In [1]:
import numpy as np
import pandas as pd
import wrangle
import matplotlib.pyplot as plt

### Wrangle Telco data

In [2]:
#gets tenure info for 2 year contract holders
df = wrangle.get_telco_tenure()

In [3]:
#peek at data
df.head()

  customer_id  monthly_charges  tenure  total_charges
0  0013-SMEOE           109.70      71        7904.25
1  0014-BMAQU            84.65      63        5377.80
2  0016-QLJIS            90.45      65        5957.90
3  0017-DINOC            45.20      54        2460.55
4  0017-IUDMW           116.80      72        8456.75

In [4]:
#gets rows and cols
df.shape

(1695, 4)

In [5]:
# convert possible whitespace into nulls , check for nulls,check for correct datatypes
df = df.replace(r'^\s*$', np.NaN, regex=True)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1695 entries, 0 to 1694
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   customer_id      1695 non-null   object
 1   monthly_charges  1695 non-null   float64
 2   tenure           1695 non-null   int64
 3   total_charges    1685 non-null   float64
dtypes: float64(2), int64(1), object(1)
memory usage: 53.1+ KB

In [6]:
#data type for total charges should be a float and not a object
df.isna().sum()

customer_id         0
monthly_charges     0
tenure              0
total_charges      10
dtype: int64

In [7]:
#total charges has 10 nulls, lets see what they are

In [8]:
null_values = pd.isnull(df['total_charges'])

In [9]:
#everyone who has a missing total charge has not had there first payment post
df[null_values]

     customer_id  monthly_charges  tenure  total_charges
234   1371-DWPAZ            56.05       0            NaN
416   2520-SGTTA            20.00       0            NaN
453   2775-SEFEE            61.90       0            NaN
505   3115-CZMZD            20.25       0            NaN
524   3213-VVOLG            25.35       0            NaN
678   4075-WKNIU            73.35       0            NaN
716   4367-NUYAO            25.75       0            NaN
726   4472-LVYGI            52.55       0            NaN
941   5709-LVOEQ            80.85       0            NaN
1293  7644-OMVMY            19.85       0            NaN

In [10]:
# for the scope of the project. we can assume that these payments will post and everyone
# in this subset will have a tenure of 1 and total_charges will  = there monthly charge

In [11]:
df['total_charges'].fillna(df['monthly_charges'], inplace = True)

In [12]:
df.isnull().sum()

customer_id        0
monthly_charges    0
tenure             0
total_charges      0
dtype: int64

In [13]:
#lets see if those nulls were filled correctly
df[null_values]

     customer_id  monthly_charges  tenure  total_charges
234   1371-DWPAZ            56.05       0          56.05
416   2520-SGTTA            20.00       0          20.00
453   2775-SEFEE            61.90       0          61.90
505   3115-CZMZD            20.25       0          20.25
524   3213-VVOLG            25.35       0          25.35
678   4075-WKNIU            73.35       0          73.35
716   4367-NUYAO            25.75       0          25.75
726   4472-LVYGI            52.55       0          52.55
941   5709-LVOEQ            80.85       0          80.85
1293  7644-OMVMY            19.85       0          19.85

In [14]:
#we can now make an attempt to turn total charges into a float

In [15]:
#attempts to convert column contents into a numeric value, if it cant it will remain a null
df['total_charges'] = pd.to_numeric(df['total_charges'],errors='coerce')

In [16]:
#lets see if it worked
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1695 entries, 0 to 1694
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   customer_id      1695 non-null   object
 1   monthly_charges  1695 non-null   float64
 2   tenure           1695 non-null   int64
 3   total_charges    1695 non-null   float64
dtypes: float64(2), int64(1), object(1)
memory usage: 53.1+ KB

In [17]:
#now we can move their tenure to 1
df.loc[df['tenure'] == 0, 'tenure'] = 1

In [18]:
#these changes are now apart of the data frame
df[null_values]

     customer_id  monthly_charges  tenure  total_charges
234   1371-DWPAZ            56.05       1          56.05
416   2520-SGTTA            20.00       1          20.00
453   2775-SEFEE            61.90       1          61.90
505   3115-CZMZD            20.25       1          20.25
524   3213-VVOLG            25.35       1          25.35
678   4075-WKNIU            73.35       1          73.35
716   4367-NUYAO            25.75       1          25.75
726   4472-LVYGI            52.55       1          52.55
941   5709-LVOEQ            80.85       1          80.85
1293  7644-OMVMY            19.85       1          19.85

In [19]:
#we will use these cleaning practices in wrangle.py. lets see it in action

In [20]:
newdf = wrangle.get_telco_tenure()

In [21]:
newdf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1695 entries, 0 to 1694
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   customer_id      1695 non-null   object
 1   monthly_charges  1695 non-null   float64
 2   tenure           1695 non-null   int64
 3   total_charges    1685 non-null   float64
dtypes: float64(2), int64(1), object(1)
memory usage: 53.1+ KB

In [22]:
newdf[null_values]

     customer_id  monthly_charges  tenure  total_charges
234   1371-DWPAZ            56.05       0            NaN
416   2520-SGTTA            20.00       0            NaN
453   2775-SEFEE            61.90       0            NaN
505   3115-CZMZD            20.25       0            NaN
524   3213-VVOLG            25.35       0            NaN
678   4075-WKNIU            73.35       0            NaN
716   4367-NUYAO            25.75       0            NaN
726   4472-LVYGI            52.55       0            NaN
941   5709-LVOEQ            80.85       0            NaN
1293  7644-OMVMY            19.85       0            NaN

In [23]:
#after df

In [24]:
after_df = wrangle.clean_telco_tenure(newdf)

In [25]:
after_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1695 entries, 0 to 1694
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   customer_id      1695 non-null   object
 1   monthly_charges  1695 non-null   float64
 2   tenure           1695 non-null   int64
 3   total_charges    1695 non-null   float64
dtypes: float64(2), int64(1), object(1)
memory usage: 53.1+ KB

In [26]:
after_df[null_values]

     customer_id  monthly_charges  tenure  total_charges
234   1371-DWPAZ            56.05       1          56.05
416   2520-SGTTA            20.00       1          20.00
453   2775-SEFEE            61.90       1          61.90
505   3115-CZMZD            20.25       1          20.25
524   3213-VVOLG            25.35       1          25.35
678   4075-WKNIU            73.35       1          73.35
716   4367-NUYAO            25.75       1          25.75
726   4472-LVYGI            52.55       1          52.55
941   5709-LVOEQ            80.85       1          80.85
1293  7644-OMVMY            19.85       1          19.85

In [27]:
#split data

In [28]:
train, validate, test = wrangle.split_for_model(after_df)

train(949, 4),validate(407, 4),test(339, 4)

### Wrangle Zillow

In [29]:
zillow_df = wrangle.get_zillow_data()

In [30]:
zillow_df.head()

,bedroomcnt,bathroomcnt,calculatedfinishedsquarefeet,taxvaluedollarcnt,yearbuilt,taxamount,fips,propertylandusetypeid
0,0.0,0.0,NaN,27516.0,NaN,NaN,6037.0,261.0
1,0.0,0.0,NaN,10.0,NaN,NaN,6037.0,261.0
2,0.0,0.0,NaN,10.0,NaN,NaN,6037.0,261.0
3,0.0,0.0,NaN,2108.0,NaN,174.21,6037.0,261.0
4,4.0,2.0,3633.0,296425.0,2005.0,6941.39,6037.0,261.0

In [31]:
zillow_df.shape

(2152863, 8)

In [32]:
zillow_df.isna().sum()

bedroomcnt                        11
bathroomcnt                       11
calculatedfinishedsquarefeet    8484
taxvaluedollarcnt                493
yearbuilt                       9337
taxamount                       4442
fips                               0
propertylandusetypeid              0
dtype: int64

In [33]:
nullbedroomcnt = pd.isnull(zillow_df['bedroomcnt'])

In [34]:
zillow_df[nullbedroomcnt]

,bedroomcnt,bathroomcnt,calculatedfinishedsquarefeet,taxvaluedollarcnt,yearbuilt,taxamount,fips,propertylandusetypeid
107763,NaN,NaN,NaN,67366.0,1926.0,780.54,6059.0,261.0
118612,NaN,NaN,NaN,43992.0,1946.0,541.64,6059.0,261.0
193993,NaN,NaN,1348.0,840698.0,1952.0,NaN,6059.0,261.0
1141339,NaN,NaN,200.0,188972.0,NaN,NaN,6037.0,261.0
1324608,NaN,NaN,990.0,435000.0,1906.0,NaN,6037.0,261.0
1442975,NaN,NaN,NaN,273196.0,NaN,NaN,6037.0,261.0
1647346,NaN,NaN,400.0,28347.0,1954.0,NaN,6037.0,261.0
1701026,NaN,NaN,NaN,407930.0,1926.0,NaN,6037.0,261.0
1722707,NaN,NaN,NaN,477161.0,NaN,NaN,6037.0,261.0
1776422,NaN,NaN,NaN,38855.0,NaN,NaN,6037.0,261.0
1797985,NaN,NaN,NaN,1017957.0,1990.0,NaN,6037.0,261.0

In [35]:
#11 nulls in a set of 2152863 rows, statistically can be dropped

#attempt to drop if whole row is null
zillow_df = zillow_df.dropna(how='all')

#drop rows based on null bedroomcount
zillow_df = zillow_df.dropna(axis=0, subset=['bedroomcnt'])

In [36]:
#relook at shape
zillow_df.shape

(2152852, 8)

In [37]:
zillow_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2152852 entries, 0 to 2152862
Data columns (total 8 columns):
 #   Column                        Dtype
---  ------                        -----
 0   bedroomcnt                    float64
 1   bathroomcnt                   float64
 2   calculatedfinishedsquarefeet  float64
 3   taxvaluedollarcnt             float64
 4   yearbuilt                     float64
 5   taxamount                     float64
 6   fips                          float64
 7   propertylandusetypeid         float64
dtypes: float64(8)
memory usage: 147.8 MB

In [38]:
#relook at null summary
zillow_df.isna().sum()

bedroomcnt                         0
bathroomcnt                        0
calculatedfinishedsquarefeet    8477
taxvaluedollarcnt                493
yearbuilt                       9333
taxamount                       4433
fips                               0
propertylandusetypeid              0
dtype: int64

In [39]:
nullsqrfeet = pd.isnull(zillow_df['calculatedfinishedsquarefeet'])

In [40]:
zillow_df[nullsqrfeet].head()

,bedroomcnt,bathroomcnt,calculatedfinishedsquarefeet,taxvaluedollarcnt,yearbuilt,taxamount,fips,propertylandusetypeid
0,0.0,0.0,NaN,27516.0,NaN,NaN,6037.0,261.0
1,0.0,0.0,NaN,10.0,NaN,NaN,6037.0,261.0
2,0.0,0.0,NaN,10.0,NaN,NaN,6037.0,261.0
3,0.0,0.0,NaN,2108.0,NaN,174.21,6037.0,261.0
5,0.0,0.0,NaN,124.0,NaN,NaN,6037.0,261.0

In [41]:
#8477/2152852 = .004% of data. wont hurt to drop
zillow_df[nullsqrfeet]

,bedroomcnt,bathroomcnt,calculatedfinishedsquarefeet,taxvaluedollarcnt,yearbuilt,taxamount,fips,propertylandusetypeid
0,0.0,0.0,NaN,27516.0,NaN,NaN,6037.0,261.0
1,0.0,0.0,NaN,10.0,NaN,NaN,6037.0,261.0
2,0.0,0.0,NaN,10.0,NaN,NaN,6037.0,261.0
3,0.0,0.0,NaN,2108.0,NaN,174.21,6037.0,261.0
5,0.0,0.0,NaN,124.0,NaN,NaN,6037.0,261.0
...,...,...,...,...,...,...,...,...
2152823,0.0,0.0,NaN,2568893.0,NaN,27309.30,6059.0,261.0
2152844,0.0,0.0,NaN,92679.0,NaN,1090.16,6111.0,261.0
2152854,0.0,0.0,NaN,1198476.0,NaN,NaN,6037.0,261.0
2152857,0.0,0.0,NaN,1087111.0,NaN,19313.08,6059.0,261.0
2152860,0.0,0.0,NaN,208057.0,NaN,5783.88,6059.0,261.0

In [42]:
zillow_df = zillow_df.dropna(axis=0, subset=['calculatedfinishedsquarefeet'])

In [43]:
zillow_df.shape

(2144375, 8)

In [44]:
zillow_df.isna().sum()

bedroomcnt                         0
bathroomcnt                        0
calculatedfinishedsquarefeet       0
taxvaluedollarcnt                115
yearbuilt                       1459
taxamount                       2683
fips                               0
propertylandusetypeid              0
dtype: int64

In [45]:
nulltaxvalue = pd.isnull(zillow_df['taxvaluedollarcnt'])

In [46]:
zillow_df[nulltaxvalue]

,bedroomcnt,bathroomcnt,calculatedfinishedsquarefeet,taxvaluedollarcnt,yearbuilt,taxamount,fips,propertylandusetypeid
26588,3.0,1.0,807.0,NaN,1924.0,NaN,6037.0,261.0
32656,2.0,2.0,1650.0,NaN,1987.0,51.86,6111.0,261.0
64003,3.0,1.0,1325.0,NaN,1927.0,NaN,6037.0,261.0
78408,2.0,1.0,1339.0,NaN,1941.0,NaN,6037.0,261.0
96548,3.0,1.0,994.0,NaN,1901.0,NaN,6037.0,261.0
...,...,...,...,...,...,...,...,...
2023588,3.0,3.0,2367.0,NaN,1984.0,NaN,6037.0,261.0
2034678,2.0,1.0,822.0,NaN,1935.0,17.66,6111.0,261.0
2057669,13.0,8.0,7894.0,NaN,1953.0,NaN,6037.0,261.0
2131055,3.0,1.0,1431.0,NaN,1923.0,NaN,6037.0,261.0
2142113,3.0,2.0,1432.0,NaN,1991.0,NaN,6037.0,261.0

In [47]:
### for dollar columns, we will fill the nulls with the mean value
zillow_df['taxvaluedollarcnt'].fillna(zillow_df['taxvaluedollarcnt'].mean(), inplace = True)
zillow_df['taxamount'].fillna(zillow_df['taxamount'].mean(), inplace = True)

In [48]:
zillow_df.isna().sum()

bedroomcnt                         0
bathroomcnt                        0
calculatedfinishedsquarefeet       0
taxvaluedollarcnt                  0
yearbuilt                       1459
taxamount                          0
fips                               0
propertylandusetypeid              0
dtype: int64

In [49]:
#create bins for yearbuilt, we'll set the missing values to mode of the the higest bin. 
import math
zmax = zillow_df.yearbuilt.max()
zmin =zillow_df.yearbuilt.min()

bins = round((zmax-zmin) /10)
bins

22

In [50]:
#value counts for every bin
pd.cut(zillow_df.yearbuilt, bins=bins, include_lowest=True, right=True ).value_counts()

(1947.591, 1957.364]    585128
(1957.364, 1967.136]    371770
(1967.136, 1976.909]    219929
(1937.818, 1947.591]    198821
(1976.909, 1986.682]    181354
(1986.682, 1996.455]    155011
(1918.273, 1928.045]    146909
(1996.455, 2006.227]    131485
(1928.045, 1937.818]     62664
(2006.227, 2016.0]       37658
(1908.5, 1918.273]       34162
(1898.727, 1908.5]       15604
(1888.955, 1898.727]      1947
(1879.182, 1888.955]       441
(1869.409, 1879.182]        20
(1800.784, 1810.773]         4
(1859.636, 1869.409]         3
(1830.318, 1840.091]         2
(1810.773, 1820.545]         2
(1849.864, 1859.636]         1
(1820.545, 1830.318]         1
(1840.091, 1849.864]         0
Name: yearbuilt, dtype: int64

In [51]:
#looks like majourity of houses were made between 1947 and 1957, we'll set our null values to the mode of that bin
mode = zillow_df[(zillow_df['yearbuilt'] > 1947) & (zillow_df['yearbuilt'] <= 1957)].yearbuilt.mode()
mode

0    1955.0
dtype: float64

In [52]:
zillow_df['yearbuilt'].fillna(value=mode[0], inplace = True)

In [53]:
zillow_df.isna().sum()

bedroomcnt                      0
bathroomcnt                     0
calculatedfinishedsquarefeet    0
taxvaluedollarcnt               0
yearbuilt                       0
taxamount                       0
fips                            0
propertylandusetypeid           0
dtype: int64

In [54]:
#test cleaning function
before_df = wrangle.get_zillow_data()
before_df.isna().sum()

bedroomcnt                        11
bathroomcnt                       11
calculatedfinishedsquarefeet    8484
taxvaluedollarcnt                493
yearbuilt                       9337
taxamount                       4442
fips                               0
propertylandusetypeid              0
dtype: int64

In [55]:
after_df = wrangle.clean_zillow_data(before_df)

In [56]:
after_df.isna().sum()

bedroomcnt                      0
bathroomcnt                     0
calculatedfinishedsquarefeet    0
taxvaluedollarcnt               0
yearbuilt                       0
taxamount                       0
fips                            0
propertylandusetypeid           0
dtype: int64

In [58]:
train, validate, split = wrangle.split_for_model(after_df)

train(1200850, 8),validate(514650, 8),test(428875, 8)